#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
github_team.organisation_teams["OpenStack"]: Refreshing state... [id=6372899]
github_issue_label.workflows_label["ansible-role-os-volumes"]: Refreshing state... [id=ansible-role-os-volumes:workflows]
github_team.organisation_teams["Kayobe"]: Refreshing state... [id=6156230]
github_team.organisation_teams["Ansible"]: Refreshing state... [id=2454000]
github_team.organisation_teams["Developers"]: Refreshing state... [id=6309608]
github_team.organisation_teams["Azimuth"]: Refreshing state... [id=6372898]
github_team.organisation_teams["ReleaseTrain"]: Refreshing state... [id=6372895]
github_team.organisation_teams["Batch"]: Refreshing state... [id=6372897]
github_issue_label.workflows_label["ansible-collection-cephadm"]: Refreshing state... [id=ansible-collection-cephadm:workflows]
github_team.organisation_teams["SMSLab"]: Refreshing state... [id=6372896]
github_issue_label.workflows_label["smslab-config"]: Refreshing state... [id=smslab-config:workflows]
github_issue_label.workflows_label["ansible-role-os-openstacksdk"]: Refreshing state... [id=ansible-role-os-openstacksdk:workflows]
github_issue_label.workflows_label["ansible-role-os-host-aggregates"]: Refreshing state... [id=ansible-role-os-host-aggregates:workflows]
github_issue_label.workflows_label["ansible-role-rundeck"]: Refreshing state... [id=ansible-role-rundeck:workflows]
github_issue_label.workflows_label["ansible-role-os-container-clusters"]: Refreshing state... [id=ansible-role-os-container-clusters:workflows]
github_issue_label.workflows_label["drac"]: Refreshing state... [id=drac:workflows]
github_issue_label.workflows_label["ansible-role-os-ironic-state"]: Refreshing state... [id=ansible-role-os-ironic-state:workflows]
github_issue_label.workflows_label["magnum"]: Refreshing state... [id=magnum:workflows]
github_issue_label.workflows_label["kayobe"]: Refreshing state... [id=kayobe:workflows]
github_issue_label.workflows_label["ansible-role-libvirt-host"]: Refreshing state... [id=ansible-role-libvirt-host:workflows]
github_issue_label.workflows_label["ansible-role-vxlan"]: Refreshing state... [id=ansible-role-vxlan:workflows]
github_issue_label.workflows_label["stackhpc-inspector-plugins"]: Refreshing state... [id=stackhpc-inspector-plugins:workflows]
github_issue_label.workflows_label["ansible-role-sriov"]: Refreshing state... [id=ansible-role-sriov:workflows]
github_issue_label.workflows_label["drac-facts"]: Refreshing state... [id=drac-facts:workflows]
github_issue_label.workflows_label["kolla"]: Refreshing state... [id=kolla:workflows]
github_issue_label.workflows_label["stackhpc.ipmi-exporter"]: Refreshing state... [id=stackhpc.ipmi-exporter:workflows]
github_issue_label.workflows_label["ansible-role-libvirt-vm"]: Refreshing state... [id=ansible-role-libvirt-vm:workflows]
github_issue_label.workflows_label["ansible-role-os-config"]: Refreshing state... [id=ansible-role-os-config:workflows]
github_issue_label.workflows_label["kolla-ansible"]: Refreshing state... [id=kolla-ansible:workflows]
github_issue_label.workflows_label["ansible-role-grafana-conf"]: Refreshing state... [id=ansible-role-grafana-conf:workflows]
github_issue_label.workflows_label["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=ansible-role-dell-powerconnect-switch:workflows]
github_issue_label.workflows_label["ansible-role-os-shade"]: Refreshing state... [id=ansible-role-os-shade:workflows]
github_issue_label.workflows_label["cloudkitty-dashboard"]: Refreshing state... [id=cloudkitty-dashboard:workflows]
github_issue_label.workflows_label["ansible-role-grubcmdline"]: Refreshing state... [id=ansible-role-grubcmdline:workflows]
github_issue_label.workflows_label["openstack-config"]: Refreshing state... [id=openstack-config:workflows]
github_issue_label.workflows_label["cloudkitty"]: Refreshing state... [id=cloudkitty:workflows]
github_issue_label.workflows_label["ansible-timezone"]: Refreshing state... [id=ansible-timezone:workflows]
github_issue_label.workflows_label["stackhpc-kayobe-config"]: Refreshing state... [id=stackhpc-kayobe-config:workflows]
github_issue_label.workflows_label["stackhpc-release-train"]: Refreshing state... [id=stackhpc-release-train:workflows]
github_issue_label.workflows_label["ansible-role-cluster-infra"]: Refreshing state... [id=ansible-role-cluster-infra:workflows]
github_issue_label.workflows_label["ansible-collection-hashicorp"]: Refreshing state... [id=ansible-collection-hashicorp:workflows]
github_issue_label.workflows_label["ansible-role-monasca-rsyslog"]: Refreshing state... [id=ansible-role-monasca-rsyslog:workflows]
github_issue_label.workflows_label["ansible-collection-pulp"]: Refreshing state... [id=ansible-collection-pulp:workflows]
github_issue_label.workflows_label["ansible-role-os-images"]: Refreshing state... [id=ansible-role-os-images:workflows]
github_issue_label.workflows_label["ansible-role-systemd-networkd"]: Refreshing state... [id=ansible-role-systemd-networkd:workflows]
github_issue_label.workflows_label["ansible-collection-openstack-ops"]: Refreshing state... [id=ansible-collection-openstack-ops:workflows]
github_issue_label.workflows_label["ansible-role-os-projects"]: Refreshing state... [id=ansible-role-os-projects:workflows]
github_issue_label.workflows_label["barbican"]: Refreshing state... [id=barbican:workflows]
github_issue_label.workflows_label["ansible-role-luks"]: Refreshing state... [id=ansible-role-luks:workflows]
github_issue_label.workflows_label["ansible-role-os-openstackclient"]: Refreshing state... [id=ansible-role-os-openstackclient:workflows]
github_issue_label.workflows_label["bifrost"]: Refreshing state... [id=bifrost:workflows]
github_issue_label.workflows_label["ansible-role-gluster-cluster"]: Refreshing state... [id=ansible-role-gluster-cluster:workflows]
github_issue_label.workflows_label["terraform-bastion"]: Refreshing state... [id=terraform-bastion:workflows]
github_issue_label.workflows_label["networking-generic-switch"]: Refreshing state... [id=networking-generic-switch:workflows]
github_issue_label.workflows_label["ansible-role-openhpc"]: Refreshing state... [id=ansible-role-openhpc:workflows]
github_issue_label.workflows_label["monasca-default-alarms"]: Refreshing state... [id=monasca-default-alarms:workflows]
github_issue_label.workflows_label["ansible-role-mlnx-neo"]: Refreshing state... [id=ansible-role-mlnx-neo:workflows]
github_issue_label.workflows_label["ansible-role-os-networks"]: Refreshing state... [id=ansible-role-os-networks:workflows]
github_issue_label.workflows_label["ansible-role-openvpn"]: Refreshing state... [id=ansible-role-openvpn:workflows]
github_issue_label.workflows_label["smslab-kayobe-config"]: Refreshing state... [id=smslab-kayobe-config:workflows]
github_issue_label.workflows_label["ansible-role-mlnx-ufm"]: Refreshing state... [id=ansible-role-mlnx-ufm:workflows]
github_issue_label.workflows_label["ansible-role-os-flavors"]: Refreshing state... [id=ansible-role-os-flavors:workflows]
github_issue_label.workflows_label["ansible-role-mellanox-switch"]: Refreshing state... [id=ansible-role-mellanox-switch:workflows]
github_issue_label.workflows_label["stackhpc.ssm"]: Refreshing state... [id=stackhpc.ssm:workflows]
github_issue_label.workflows_label["ironic-python-agent"]: Refreshing state... [id=ironic-python-agent:workflows]
github_issue_label.workflows_label["stackhpc-release-train-clients"]: Refreshing state... [id=stackhpc-release-train-clients:workflows]
data.github_repository.repositories["ansible-role-mellanox-switch"]: Reading...
data.github_repository.repositories["ansible-collection-hashicorp"]: Reading...
data.github_repository.repositories["ansible-role-rundeck"]: Reading...
data.github_repository.repositories["ansible-timezone"]: Reading...
data.github_repository.repositories["ansible-role-os-openstacksdk"]: Reading...
data.github_repository.repositories["stackhpc.ssm"]: Reading...
data.github_repository.repositories["ansible-collection-openstack-ops"]: Reading...
data.github_repository.repositories["networking-generic-switch"]: Reading...
github_issue_label.stackhpc_ci_label["ansible-role-mlnx-ufm"]: Refreshing state... [id=ansible-role-mlnx-ufm:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-timezone"]: Refreshing state... [id=ansible-timezone:stackhpc-ci]
github_issue_label.stackhpc_ci_label["bifrost"]: Refreshing state... [id=bifrost:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-projects"]: Refreshing state... [id=ansible-role-os-projects:stackhpc-ci]
data.github_repository.repositories["ansible-role-mellanox-switch"]: Read complete after 4s [id=ansible-role-mellanox-switch]
github_issue_label.stackhpc_ci_label["stackhpc.ssm"]: Refreshing state... [id=stackhpc.ssm:stackhpc-ci]
data.github_repository.repositories["ansible-collection-hashicorp"]: Read complete after 3s [id=ansible-collection-hashicorp]
github_issue_label.stackhpc_ci_label["drac-facts"]: Refreshing state... [id=drac-facts:stackhpc-ci]
data.github_repository.repositories["ansible-role-rundeck"]: Read complete after 4s [id=ansible-role-rundeck]
data.github_repository.repositories["ansible-role-luks"]: Reading...
data.github_repository.repositories["ansible-timezone"]: Read complete after 4s [id=ansible-timezone]
data.github_repository.repositories["ansible-role-os-container-clusters"]: Reading...
data.github_repository.repositories["ansible-role-os-openstacksdk"]: Read complete after 4s [id=ansible-role-os-openstacksdk]
data.github_repository.repositories["stackhpc.ipmi-exporter"]: Reading...
data.github_repository.repositories["stackhpc.ssm"]: Read complete after 4s [id=stackhpc.ssm]
data.github_repository.repositories["ansible-role-openvpn"]: Reading...
data.github_repository.repositories["ansible-collection-openstack-ops"]: Read complete after 4s [id=ansible-collection-openstack-ops]
data.github_repository.repositories["ansible-role-os-volumes"]: Reading...
data.github_repository.repositories["networking-generic-switch"]: Read complete after 4s [id=networking-generic-switch]
data.github_repository.repositories["ironic-python-agent"]: Reading...
data.github_repository.repositories["cloudkitty-dashboard"]: Reading...
data.github_repository.repositories["smslab-config"]: Reading...
data.github_repository.repositories["ansible-role-libvirt-vm"]: Reading...
data.github_repository.repositories["ansible-collection-cephadm"]: Reading...
data.github_repository.repositories["smslab-config"]: Read complete after 2s [id=smslab-config]
data.github_repository.repositories["ansible-role-monasca-rsyslog"]: Reading...
data.github_repository.repositories["ansible-role-luks"]: Read complete after 4s [id=ansible-role-luks]
data.github_repository.repositories["stackhpc-inspector-plugins"]: Reading...
data.github_repository.repositories["ansible-role-os-container-clusters"]: Read complete after 4s [id=ansible-role-os-container-clusters]
data.github_repository.repositories["ansible-role-vxlan"]: Reading...
data.github_repository.repositories["stackhpc.ipmi-exporter"]: Read complete after 4s [id=stackhpc.ipmi-exporter]
data.github_repository.repositories["stackhpc-release-train"]: Reading...
data.github_repository.repositories["ansible-role-openvpn"]: Read complete after 5s [id=ansible-role-openvpn]
data.github_repository.repositories["terraform-bastion"]: Reading...
data.github_repository.repositories["ansible-role-os-volumes"]: Read complete after 5s [id=ansible-role-os-volumes]
data.github_repository.repositories["ansible-role-grafana-conf"]: Reading...
data.github_repository.repositories["ironic-python-agent"]: Read complete after 4s [id=ironic-python-agent]
data.github_repository.repositories["ansible-role-os-openstackclient"]: Reading...
data.github_repository.repositories["cloudkitty-dashboard"]: Read complete after 4s [id=cloudkitty-dashboard]
data.github_repository.repositories["ansible-collection-pulp"]: Reading...
data.github_repository.repositories["ansible-role-libvirt-vm"]: Read complete after 5s [id=ansible-role-libvirt-vm]
data.github_repository.repositories["ansible-role-gluster-cluster"]: Reading...
data.github_repository.repositories["ansible-collection-cephadm"]: Read complete after 5s [id=ansible-collection-cephadm]
data.github_repository.repositories["cloudkitty"]: Reading...
data.github_repository.repositories["ansible-role-monasca-rsyslog"]: Read complete after 4s [id=ansible-role-monasca-rsyslog]
data.github_repository.repositories["ansible-role-os-flavors"]: Reading...
data.github_repository.repositories["stackhpc-inspector-plugins"]: Read complete after 4s [id=stackhpc-inspector-plugins]
data.github_repository.repositories["ansible-role-os-config"]: Reading...
data.github_repository.repositories["ansible-role-vxlan"]: Read complete after 4s [id=ansible-role-vxlan]
data.github_repository.repositories["kolla"]: Reading...
data.github_repository.repositories["terraform-bastion"]: Read complete after 4s [id=terraform-bastion]
data.github_repository.repositories["drac"]: Reading...
data.github_repository.repositories["ansible-role-grafana-conf"]: Read complete after 4s [id=ansible-role-grafana-conf]
data.github_repository.repositories["ansible-role-os-projects"]: Reading...
data.github_repository.repositories["ansible-role-os-openstackclient"]: Read complete after 4s [id=ansible-role-os-openstackclient]
data.github_repository.repositories["ansible-role-os-images"]: Reading...
data.github_repository.repositories["ansible-collection-pulp"]: Read complete after 4s [id=ansible-collection-pulp]
data.github_repository.repositories["ansible-role-sriov"]: Reading...
data.github_repository.repositories["ansible-role-gluster-cluster"]: Read complete after 4s [id=ansible-role-gluster-cluster]
data.github_repository.repositories["ansible-role-os-ironic-state"]: Reading...
data.github_repository.repositories["cloudkitty"]: Read complete after 4s [id=cloudkitty]
data.github_repository.repositories["magnum"]: Reading...
data.github_repository.repositories["stackhpc-release-train"]: Read complete after 6s [id=stackhpc-release-train]
data.github_repository.repositories["ansible-role-cluster-infra"]: Reading...
data.github_repository.repositories["ansible-role-os-flavors"]: Read complete after 4s [id=ansible-role-os-flavors]
data.github_repository.repositories["stackhpc-release-train-clients"]: Reading...
data.github_repository.repositories["ansible-role-os-config"]: Read complete after 4s [id=ansible-role-os-config]
data.github_repository.repositories["openstack-config"]: Reading...
data.github_repository.repositories["kolla"]: Read complete after 4s [id=kolla]
data.github_repository.repositories["ansible-role-grubcmdline"]: Reading...
data.github_repository.repositories["drac"]: Read complete after 4s [id=drac]
data.github_repository.repositories["ansible-role-os-networks"]: Reading...
data.github_repository.repositories["ansible-role-os-projects"]: Read complete after 4s [id=ansible-role-os-projects]
data.github_repository.repositories["ansible-role-mlnx-ufm"]: Reading...
data.github_repository.repositories["ansible-role-os-images"]: Read complete after 4s [id=ansible-role-os-images]
data.github_repository.repositories["barbican"]: Reading...
data.github_repository.repositories["ansible-role-sriov"]: Read complete after 4s [id=ansible-role-sriov]
data.github_repository.repositories["ansible-role-os-host-aggregates"]: Reading...
data.github_repository.repositories["ansible-role-os-ironic-state"]: Read complete after 4s [id=ansible-role-os-ironic-state]
data.github_repository.repositories["bifrost"]: Reading...
data.github_repository.repositories["magnum"]: Read complete after 4s [id=magnum]
data.github_repository.repositories["ansible-role-mlnx-neo"]: Reading...
data.github_repository.repositories["ansible-role-cluster-infra"]: Read complete after 5s [id=ansible-role-cluster-infra]
data.github_repository.repositories["ansible-role-libvirt-host"]: Reading...
data.github_repository.repositories["stackhpc-release-train-clients"]: Read complete after 5s [id=stackhpc-release-train-clients]
data.github_repository.repositories["ansible-role-dell-powerconnect-switch"]: Reading...
data.github_repository.repositories["openstack-config"]: Read complete after 4s [id=openstack-config]
data.github_repository.repositories["kolla-ansible"]: Reading...
data.github_repository.repositories["ansible-role-grubcmdline"]: Read complete after 4s [id=ansible-role-grubcmdline]
data.github_repository.repositories["monasca-default-alarms"]: Reading...
data.github_repository.repositories["ansible-role-os-networks"]: Read complete after 4s [id=ansible-role-os-networks]
data.github_repository.repositories["stackhpc-kayobe-config"]: Reading...
data.github_repository.repositories["ansible-role-mlnx-ufm"]: Read complete after 4s [id=ansible-role-mlnx-ufm]
data.github_repository.repositories["drac-facts"]: Reading...
data.github_repository.repositories["barbican"]: Read complete after 4s [id=barbican]
data.github_repository.repositories["smslab-kayobe-config"]: Reading...
data.github_repository.repositories["ansible-role-os-host-aggregates"]: Read complete after 4s [id=ansible-role-os-host-aggregates]
data.github_repository.repositories["kayobe"]: Reading...
data.github_repository.repositories["bifrost"]: Read complete after 4s [id=bifrost]
data.github_repository.repositories["ansible-role-os-shade"]: Reading...
data.github_repository.repositories["ansible-role-mlnx-neo"]: Read complete after 4s [id=ansible-role-mlnx-neo]
data.github_repository.repositories["ansible-role-systemd-networkd"]: Reading...
data.github_repository.repositories["ansible-role-libvirt-host"]: Read complete after 4s [id=ansible-role-libvirt-host]
data.github_repository.repositories["openstack-admin-guide"]: Reading...
data.github_repository.repositories["ansible-role-dell-powerconnect-switch"]: Read complete after 4s [id=ansible-role-dell-powerconnect-switch]
github_issue_label.stackhpc_ci_label["ansible-role-os-container-clusters"]: Refreshing state... [id=ansible-role-os-container-clusters:stackhpc-ci]
data.github_repository.repositories["kolla-ansible"]: Read complete after 4s [id=kolla-ansible]
github_issue_label.stackhpc_ci_label["ansible-role-luks"]: Refreshing state... [id=ansible-role-luks:stackhpc-ci]
data.github_repository.repositories["monasca-default-alarms"]: Read complete after 5s [id=monasca-default-alarms]
github_issue_label.stackhpc_ci_label["smslab-kayobe-config"]: Refreshing state... [id=smslab-kayobe-config:stackhpc-ci]
data.github_repository.repositories["stackhpc-kayobe-config"]: Read complete after 4s [id=stackhpc-kayobe-config]
github_issue_label.stackhpc_ci_label["cloudkitty-dashboard"]: Refreshing state... [id=cloudkitty-dashboard:stackhpc-ci]
data.github_repository.repositories["drac-facts"]: Read complete after 4s [id=drac-facts]
github_issue_label.stackhpc_ci_label["drac"]: Refreshing state... [id=drac:stackhpc-ci]
data.github_repository.repositories["smslab-kayobe-config"]: Read complete after 4s [id=smslab-kayobe-config]
github_issue_label.stackhpc_ci_label["ansible-role-os-images"]: Refreshing state... [id=ansible-role-os-images:stackhpc-ci]
data.github_repository.repositories["kayobe"]: Read complete after 5s [id=kayobe]
github_issue_label.stackhpc_ci_label["ansible-role-openhpc"]: Refreshing state... [id=ansible-role-openhpc:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-config"]: Refreshing state... [id=ansible-role-os-config:stackhpc-ci]
data.github_repository.repositories["ansible-role-os-shade"]: Read complete after 4s [id=ansible-role-os-shade]
github_issue_label.stackhpc_ci_label["ansible-role-mellanox-switch"]: Refreshing state... [id=ansible-role-mellanox-switch:stackhpc-ci]
data.github_repository.repositories["ansible-role-systemd-networkd"]: Read complete after 4s [id=ansible-role-systemd-networkd]
github_issue_label.stackhpc_ci_label["ansible-collection-openstack-ops"]: Refreshing state... [id=ansible-collection-openstack-ops:stackhpc-ci]
github_issue_label.stackhpc_ci_label["smslab-config"]: Refreshing state... [id=smslab-config:stackhpc-ci]
github_issue_label.stackhpc_ci_label["kolla"]: Refreshing state... [id=kolla:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-openvpn"]: Refreshing state... [id=ansible-role-openvpn:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-vxlan"]: Refreshing state... [id=ansible-role-vxlan:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-openstacksdk"]: Refreshing state... [id=ansible-role-os-openstacksdk:stackhpc-ci]
github_issue_label.stackhpc_ci_label["monasca-default-alarms"]: Refreshing state... [id=monasca-default-alarms:stackhpc-ci]
github_issue_label.stackhpc_ci_label["openstack-config"]: Refreshing state... [id=openstack-config:stackhpc-ci]
github_issue_label.stackhpc_ci_label["stackhpc.ipmi-exporter"]: Refreshing state... [id=stackhpc.ipmi-exporter:stackhpc-ci]
github_issue_label.stackhpc_ci_label["terraform-bastion"]: Refreshing state... [id=terraform-bastion:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-collection-pulp"]: Refreshing state... [id=ansible-collection-pulp:stackhpc-ci]
github_issue_label.stackhpc_ci_label["magnum"]: Refreshing state... [id=magnum:stackhpc-ci]
data.github_repository.repositories["openstack-admin-guide"]: Read complete after 5s [id=openstack-admin-guide]
github_issue_label.stackhpc_ci_label["ansible-role-gluster-cluster"]: Refreshing state... [id=ansible-role-gluster-cluster:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-grafana-conf"]: Refreshing state... [id=ansible-role-grafana-conf:stackhpc-ci]
github_issue_label.stackhpc_ci_label["barbican"]: Refreshing state... [id=barbican:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-mlnx-neo"]: Refreshing state... [id=ansible-role-mlnx-neo:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-collection-hashicorp"]: Refreshing state... [id=ansible-collection-hashicorp:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-networks"]: Refreshing state... [id=ansible-role-os-networks:stackhpc-ci]
github_issue_label.stackhpc_ci_label["cloudkitty"]: Refreshing state... [id=cloudkitty:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=ansible-role-dell-powerconnect-switch:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-monasca-rsyslog"]: Refreshing state... [id=ansible-role-monasca-rsyslog:stackhpc-ci]
github_issue_label.stackhpc_ci_label["kayobe"]: Refreshing state... [id=kayobe:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-host-aggregates"]: Refreshing state... [id=ansible-role-os-host-aggregates:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-systemd-networkd"]: Refreshing state... [id=ansible-role-systemd-networkd:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-ironic-state"]: Refreshing state... [id=ansible-role-os-ironic-state:stackhpc-ci]
github_issue_label.stackhpc_ci_label["stackhpc-release-train"]: Refreshing state... [id=stackhpc-release-train:stackhpc-ci]
github_issue_label.stackhpc_ci_label["stackhpc-inspector-plugins"]: Refreshing state... [id=stackhpc-inspector-plugins:stackhpc-ci]
github_issue_label.stackhpc_ci_label["kolla-ansible"]: Refreshing state... [id=kolla-ansible:stackhpc-ci]
github_issue_label.stackhpc_ci_label["stackhpc-release-train-clients"]: Refreshing state... [id=stackhpc-release-train-clients:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-libvirt-vm"]: Refreshing state... [id=ansible-role-libvirt-vm:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-libvirt-host"]: Refreshing state... [id=ansible-role-libvirt-host:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-cluster-infra"]: Refreshing state... [id=ansible-role-cluster-infra:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ironic-python-agent"]: Refreshing state... [id=ironic-python-agent:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-sriov"]: Refreshing state... [id=ansible-role-sriov:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-grubcmdline"]: Refreshing state... [id=ansible-role-grubcmdline:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-openstackclient"]: Refreshing state... [id=ansible-role-os-openstackclient:stackhpc-ci]
github_issue_label.stackhpc_ci_label["networking-generic-switch"]: Refreshing state... [id=networking-generic-switch:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-collection-cephadm"]: Refreshing state... [id=ansible-collection-cephadm:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-shade"]: Refreshing state... [id=ansible-role-os-shade:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-rundeck"]: Refreshing state... [id=ansible-role-rundeck:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-flavors"]: Refreshing state... [id=ansible-role-os-flavors:stackhpc-ci]
github_issue_label.stackhpc_ci_label["ansible-role-os-volumes"]: Refreshing state... [id=ansible-role-os-volumes:stackhpc-ci]
github_issue_label.stackhpc_ci_label["stackhpc-kayobe-config"]: Refreshing state... [id=stackhpc-kayobe-config:stackhpc-ci]
data.github_repository.repositories["ansible-role-openhpc"]: Reading...
github_issue_label.community_files_label["ansible-role-os-shade"]: Refreshing state... [id=ansible-role-os-shade:community-files]
github_issue_label.community_files_label["ansible-role-cluster-infra"]: Refreshing state... [id=ansible-role-cluster-infra:community-files]
github_issue_label.community_files_label["kayobe"]: Refreshing state... [id=kayobe:community-files]
github_issue_label.community_files_label["ansible-role-openhpc"]: Refreshing state... [id=ansible-role-openhpc:community-files]
github_issue_label.community_files_label["ansible-role-sriov"]: Refreshing state... [id=ansible-role-sriov:community-files]
github_issue_label.community_files_label["ansible-role-os-volumes"]: Refreshing state... [id=ansible-role-os-volumes:community-files]
github_issue_label.community_files_label["stackhpc.ssm"]: Refreshing state... [id=stackhpc.ssm:community-files]
github_issue_label.community_files_label["barbican"]: Refreshing state... [id=barbican:community-files]
github_issue_label.community_files_label["smslab-config"]: Refreshing state... [id=smslab-config:community-files]
github_issue_label.community_files_label["ansible-role-gluster-cluster"]: Refreshing state... [id=ansible-role-gluster-cluster:community-files]
github_issue_label.community_files_label["ansible-role-os-ironic-state"]: Refreshing state... [id=ansible-role-os-ironic-state:community-files]
github_issue_label.community_files_label["ansible-role-luks"]: Refreshing state... [id=ansible-role-luks:community-files]
github_issue_label.community_files_label["stackhpc-release-train-clients"]: Refreshing state... [id=stackhpc-release-train-clients:community-files]
github_issue_label.community_files_label["openstack-config"]: Refreshing state... [id=openstack-config:community-files]
github_issue_label.community_files_label["cloudkitty-dashboard"]: Refreshing state... [id=cloudkitty-dashboard:community-files]
github_issue_label.community_files_label["stackhpc.ipmi-exporter"]: Refreshing state... [id=stackhpc.ipmi-exporter:community-files]
github_issue_label.community_files_label["networking-generic-switch"]: Refreshing state... [id=networking-generic-switch:community-files]
github_issue_label.community_files_label["ansible-role-os-openstackclient"]: Refreshing state... [id=ansible-role-os-openstackclient:community-files]
data.github_repository.repositories["ansible-role-openhpc"]: Read complete after 4s [id=ansible-role-openhpc]
github_issue_label.community_files_label["ansible-role-mlnx-neo"]: Refreshing state... [id=ansible-role-mlnx-neo:community-files]
github_issue_label.community_files_label["ansible-role-os-projects"]: Refreshing state... [id=ansible-role-os-projects:community-files]
github_issue_label.community_files_label["ironic-python-agent"]: Refreshing state... [id=ironic-python-agent:community-files]
github_issue_label.community_files_label["ansible-role-openvpn"]: Refreshing state... [id=ansible-role-openvpn:community-files]
github_issue_label.community_files_label["kolla"]: Refreshing state... [id=kolla:community-files]
github_issue_label.community_files_label["ansible-role-grafana-conf"]: Refreshing state... [id=ansible-role-grafana-conf:community-files]
github_issue_label.community_files_label["magnum"]: Refreshing state... [id=magnum:community-files]
github_issue_label.community_files_label["stackhpc-kayobe-config"]: Refreshing state... [id=stackhpc-kayobe-config:community-files]
github_issue_label.community_files_label["stackhpc-release-train"]: Refreshing state... [id=stackhpc-release-train:community-files]
github_issue_label.community_files_label["ansible-role-mlnx-ufm"]: Refreshing state... [id=ansible-role-mlnx-ufm:community-files]
github_issue_label.community_files_label["kolla-ansible"]: Refreshing state... [id=kolla-ansible:community-files]
github_issue_label.community_files_label["ansible-role-os-images"]: Refreshing state... [id=ansible-role-os-images:community-files]
github_issue_label.community_files_label["ansible-role-os-openstacksdk"]: Refreshing state... [id=ansible-role-os-openstacksdk:community-files]
github_issue_label.community_files_label["ansible-collection-cephadm"]: Refreshing state... [id=ansible-collection-cephadm:community-files]
github_issue_label.community_files_label["ansible-role-os-container-clusters"]: Refreshing state... [id=ansible-role-os-container-clusters:community-files]
github_issue_label.community_files_label["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=ansible-role-dell-powerconnect-switch:community-files]
github_issue_label.community_files_label["ansible-collection-hashicorp"]: Refreshing state... [id=ansible-collection-hashicorp:community-files]
github_issue_label.community_files_label["ansible-role-os-config"]: Refreshing state... [id=ansible-role-os-config:community-files]
github_issue_label.community_files_label["ansible-role-monasca-rsyslog"]: Refreshing state... [id=ansible-role-monasca-rsyslog:community-files]
github_issue_label.community_files_label["stackhpc-inspector-plugins"]: Refreshing state... [id=stackhpc-inspector-plugins:community-files]
github_issue_label.community_files_label["drac"]: Refreshing state... [id=drac:community-files]
github_issue_label.community_files_label["smslab-kayobe-config"]: Refreshing state... [id=smslab-kayobe-config:community-files]
github_issue_label.community_files_label["ansible-role-os-flavors"]: Refreshing state... [id=ansible-role-os-flavors:community-files]
github_issue_label.community_files_label["ansible-role-rundeck"]: Refreshing state... [id=ansible-role-rundeck:community-files]
github_issue_label.community_files_label["ansible-role-systemd-networkd"]: Refreshing state... [id=ansible-role-systemd-networkd:community-files]
github_issue_label.community_files_label["ansible-timezone"]: Refreshing state... [id=ansible-timezone:community-files]
github_issue_label.community_files_label["ansible-role-libvirt-host"]: Refreshing state... [id=ansible-role-libvirt-host:community-files]
github_issue_label.community_files_label["bifrost"]: Refreshing state... [id=bifrost:community-files]
github_issue_label.community_files_label["ansible-collection-openstack-ops"]: Refreshing state... [id=ansible-collection-openstack-ops:community-files]
github_issue_label.community_files_label["terraform-bastion"]: Refreshing state... [id=terraform-bastion:community-files]
github_issue_label.community_files_label["ansible-role-vxlan"]: Refreshing state... [id=ansible-role-vxlan:community-files]
github_issue_label.community_files_label["ansible-role-grubcmdline"]: Refreshing state... [id=ansible-role-grubcmdline:community-files]
github_issue_label.community_files_label["monasca-default-alarms"]: Refreshing state... [id=monasca-default-alarms:community-files]
github_issue_label.community_files_label["ansible-role-os-host-aggregates"]: Refreshing state... [id=ansible-role-os-host-aggregates:community-files]
github_issue_label.community_files_label["ansible-collection-pulp"]: Refreshing state... [id=ansible-collection-pulp:community-files]
github_issue_label.community_files_label["ansible-role-os-networks"]: Refreshing state... [id=ansible-role-os-networks:community-files]
github_issue_label.community_files_label["cloudkitty"]: Refreshing state... [id=cloudkitty:community-files]
github_issue_label.community_files_label["drac-facts"]: Refreshing state... [id=drac-facts:community-files]
github_issue_label.community_files_label["ansible-role-mellanox-switch"]: Refreshing state... [id=ansible-role-mellanox-switch:community-files]
github_issue_label.community_files_label["ansible-role-libvirt-vm"]: Refreshing state... [id=ansible-role-libvirt-vm:community-files]
github_repository.repositories["kayobe"]: Refreshing state... [id=kayobe]
github_repository.repositories["ansible-role-os-shade"]: Refreshing state... [id=ansible-role-os-shade]
github_repository.repositories["monasca-default-alarms"]: Refreshing state... [id=monasca-default-alarms]
github_repository.repositories["ansible-role-mellanox-switch"]: Refreshing state... [id=ansible-role-mellanox-switch]
github_repository.repositories["ansible-collection-hashicorp"]: Refreshing state... [id=ansible-collection-hashicorp]
github_repository.repositories["drac-facts"]: Refreshing state... [id=drac-facts]
github_repository.repositories["ansible-role-sriov"]: Refreshing state... [id=ansible-role-sriov]
github_repository.repositories["ansible-role-os-openstacksdk"]: Refreshing state... [id=ansible-role-os-openstacksdk]
github_repository.repositories["bifrost"]: Refreshing state... [id=bifrost]
github_repository.repositories["kolla"]: Refreshing state... [id=kolla]
github_repository.repositories["cloudkitty-dashboard"]: Refreshing state... [id=cloudkitty-dashboard]
github_repository.repositories["magnum"]: Refreshing state... [id=magnum]
github_repository.repositories["ansible-role-os-openstackclient"]: Refreshing state... [id=ansible-role-os-openstackclient]
github_repository.repositories["ansible-role-os-volumes"]: Refreshing state... [id=ansible-role-os-volumes]
github_repository.repositories["ansible-role-rundeck"]: Refreshing state... [id=ansible-role-rundeck]
github_repository.repositories["ansible-role-openhpc"]: Refreshing state... [id=ansible-role-openhpc]
github_repository.repositories["ansible-role-libvirt-vm"]: Refreshing state... [id=ansible-role-libvirt-vm]
github_repository.repositories["barbican"]: Refreshing state... [id=barbican]
github_repository.repositories["ansible-role-os-config"]: Refreshing state... [id=ansible-role-os-config]
github_repository.repositories["stackhpc-release-train"]: Refreshing state... [id=stackhpc-release-train]
github_repository.repositories["ansible-role-os-images"]: Refreshing state... [id=ansible-role-os-images]
github_repository.repositories["terraform-bastion"]: Refreshing state... [id=terraform-bastion]
github_repository.repositories["ansible-role-libvirt-host"]: Refreshing state... [id=ansible-role-libvirt-host]
github_repository.repositories["ansible-role-grubcmdline"]: Refreshing state... [id=ansible-role-grubcmdline]
github_repository.repositories["ansible-collection-cephadm"]: Refreshing state... [id=ansible-collection-cephadm]
github_repository.repositories["cloudkitty"]: Refreshing state... [id=cloudkitty]
github_repository.repositories["ansible-role-mlnx-ufm"]: Refreshing state... [id=ansible-role-mlnx-ufm]
github_repository.repositories["openstack-config"]: Refreshing state... [id=openstack-config]
github_repository.repositories["ansible-role-openvpn"]: Refreshing state... [id=ansible-role-openvpn]
github_repository.repositories["ansible-role-mlnx-neo"]: Refreshing state... [id=ansible-role-mlnx-neo]
github_repository.repositories["ansible-timezone"]: Refreshing state... [id=ansible-timezone]
github_repository.repositories["ansible-role-os-flavors"]: Refreshing state... [id=ansible-role-os-flavors]
github_repository.repositories["ansible-role-os-networks"]: Refreshing state... [id=ansible-role-os-networks]
github_repository.repositories["stackhpc.ssm"]: Refreshing state... [id=stackhpc.ssm]
github_repository.repositories["ansible-role-monasca-rsyslog"]: Refreshing state... [id=ansible-role-monasca-rsyslog]
github_repository.repositories["ansible-role-os-host-aggregates"]: Refreshing state... [id=ansible-role-os-host-aggregates]
github_repository.repositories["ansible-role-os-projects"]: Refreshing state... [id=ansible-role-os-projects]
github_repository.repositories["ansible-role-vxlan"]: Refreshing state... [id=ansible-role-vxlan]
github_repository.repositories["ansible-role-grafana-conf"]: Refreshing state... [id=ansible-role-grafana-conf]
github_repository.repositories["stackhpc-inspector-plugins"]: Refreshing state... [id=stackhpc-inspector-plugins]
github_repository.repositories["drac"]: Refreshing state... [id=drac]
github_repository.repositories["ansible-collection-pulp"]: Refreshing state... [id=ansible-collection-pulp]
github_repository.repositories["stackhpc-kayobe-config"]: Refreshing state... [id=stackhpc-kayobe-config]
github_repository.repositories["ansible-role-systemd-networkd"]: Refreshing state... [id=ansible-role-systemd-networkd]
github_repository.repositories["ansible-role-os-ironic-state"]: Refreshing state... [id=ansible-role-os-ironic-state]
github_repository.repositories["ansible-role-cluster-infra"]: Refreshing state... [id=ansible-role-cluster-infra]
github_repository.repositories["ansible-collection-openstack-ops"]: Refreshing state... [id=ansible-collection-openstack-ops]
github_repository.repositories["ansible-role-luks"]: Refreshing state... [id=ansible-role-luks]
github_repository.repositories["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=ansible-role-dell-powerconnect-switch]
github_repository.repositories["smslab-config"]: Refreshing state... [id=smslab-config]
github_repository.repositories["smslab-kayobe-config"]: Refreshing state... [id=smslab-kayobe-config]
github_repository.repositories["networking-generic-switch"]: Refreshing state... [id=networking-generic-switch]
github_repository.repositories["ansible-role-gluster-cluster"]: Refreshing state... [id=ansible-role-gluster-cluster]
github_repository.repositories["ironic-python-agent"]: Refreshing state... [id=ironic-python-agent]
github_repository.repositories["stackhpc-release-train-clients"]: Refreshing state... [id=stackhpc-release-train-clients]
github_repository.repositories["stackhpc.ipmi-exporter"]: Refreshing state... [id=stackhpc.ipmi-exporter]
github_repository.repositories["kolla-ansible"]: Refreshing state... [id=kolla-ansible]
github_repository.repositories["ansible-role-os-container-clusters"]: Refreshing state... [id=ansible-role-os-container-clusters]
github_team_repository.smslab_repositories["smslab-kayobe-config"]: Refreshing state... [id=6372896:smslab-kayobe-config]
github_team_repository.batch_repositories["ansible-role-openhpc"]: Refreshing state... [id=6372897:ansible-role-openhpc]
github_team_repository.kayobe_repositories["kayobe"]: Refreshing state... [id=6156230:kayobe]
github_team_repository.kayobe_repositories["stackhpc-kayobe-config"]: Refreshing state... [id=6156230:stackhpc-kayobe-config]
github_team_repository.kayobe_repositories["kolla"]: Refreshing state... [id=6156230:kolla]
github_team_repository.kayobe_repositories["kolla-ansible"]: Refreshing state... [id=6156230:kolla-ansible]
github_team_repository.smslab_repositories["terraform-bastion"]: Refreshing state... [id=6372896:terraform-bastion]
github_team_repository.smslab_repositories["smslab-config"]: Refreshing state... [id=6372896:smslab-config]
github_team_repository.developers_repositories["ansible-role-systemd-networkd"]: Refreshing state... [id=6309608:ansible-role-systemd-networkd]
github_team_repository.developers_repositories["ansible-role-openhpc"]: Refreshing state... [id=6309608:ansible-role-openhpc]
github_team_repository.developers_repositories["stackhpc-release-train-clients"]: Refreshing state... [id=6309608:stackhpc-release-train-clients]
github_team_repository.developers_repositories["ansible-role-os-volumes"]: Refreshing state... [id=6309608:ansible-role-os-volumes]
github_team_repository.developers_repositories["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=6309608:ansible-role-dell-powerconnect-switch]
github_team_repository.developers_repositories["stackhpc.ssm"]: Refreshing state... [id=6309608:stackhpc.ssm]
github_team_repository.developers_repositories["ansible-role-os-shade"]: Refreshing state... [id=6309608:ansible-role-os-shade]
github_team_repository.developers_repositories["ansible-collection-hashicorp"]: Refreshing state... [id=6309608:ansible-collection-hashicorp]
github_team_repository.developers_repositories["ansible-role-libvirt-vm"]: Refreshing state... [id=6309608:ansible-role-libvirt-vm]
github_team_repository.developers_repositories["ansible-role-openvpn"]: Refreshing state... [id=6309608:ansible-role-openvpn]
github_team_repository.developers_repositories["ansible-role-grubcmdline"]: Refreshing state... [id=6309608:ansible-role-grubcmdline]
github_team_repository.developers_repositories["openstack-config"]: Refreshing state... [id=6309608:openstack-config]
github_team_repository.developers_repositories["ansible-role-mlnx-neo"]: Refreshing state... [id=6309608:ansible-role-mlnx-neo]
github_team_repository.developers_repositories["ansible-role-os-openstackclient"]: Refreshing state... [id=6309608:ansible-role-os-openstackclient]
github_team_repository.developers_repositories["stackhpc.ipmi-exporter"]: Refreshing state... [id=6309608:stackhpc.ipmi-exporter]
github_team_repository.developers_repositories["ansible-timezone"]: Refreshing state... [id=6309608:ansible-timezone]
github_team_repository.developers_repositories["ansible-role-rundeck"]: Refreshing state... [id=6309608:ansible-role-rundeck]
github_team_repository.developers_repositories["ansible-role-os-ironic-state"]: Refreshing state... [id=6309608:ansible-role-os-ironic-state]
github_team_repository.developers_repositories["ansible-role-cluster-infra"]: Refreshing state... [id=6309608:ansible-role-cluster-infra]
github_team_repository.developers_repositories["cloudkitty-dashboard"]: Refreshing state... [id=6309608:cloudkitty-dashboard]
github_team_repository.developers_repositories["cloudkitty"]: Refreshing state... [id=6309608:cloudkitty]
github_team_repository.developers_repositories["ansible-role-os-networks"]: Refreshing state... [id=6309608:ansible-role-os-networks]
github_team_repository.developers_repositories["kolla"]: Refreshing state... [id=6309608:kolla]
github_team_repository.developers_repositories["ansible-role-monasca-rsyslog"]: Refreshing state... [id=6309608:ansible-role-monasca-rsyslog]
github_team_repository.developers_repositories["terraform-bastion"]: Refreshing state... [id=6309608:terraform-bastion]
github_team_repository.developers_repositories["ansible-role-os-projects"]: Refreshing state... [id=6309608:ansible-role-os-projects]
github_team_repository.developers_repositories["stackhpc-release-train"]: Refreshing state... [id=6309608:stackhpc-release-train]
github_team_repository.developers_repositories["ansible-role-os-host-aggregates"]: Refreshing state... [id=6309608:ansible-role-os-host-aggregates]
github_team_repository.developers_repositories["ansible-role-os-openstacksdk"]: Refreshing state... [id=6309608:ansible-role-os-openstacksdk]
github_team_repository.developers_repositories["bifrost"]: Refreshing state... [id=6309608:bifrost]
github_team_repository.developers_repositories["ansible-role-sriov"]: Refreshing state... [id=6309608:ansible-role-sriov]
github_team_repository.developers_repositories["kolla-ansible"]: Refreshing state... [id=6309608:kolla-ansible]
github_team_repository.developers_repositories["ansible-role-grafana-conf"]: Refreshing state... [id=6309608:ansible-role-grafana-conf]
github_team_repository.developers_repositories["magnum"]: Refreshing state... [id=6309608:magnum]
github_team_repository.developers_repositories["smslab-config"]: Refreshing state... [id=6309608:smslab-config]
github_team_repository.developers_repositories["ansible-role-vxlan"]: Refreshing state... [id=6309608:ansible-role-vxlan]
github_team_repository.developers_repositories["ansible-role-mellanox-switch"]: Refreshing state... [id=6309608:ansible-role-mellanox-switch]
github_team_repository.developers_repositories["kayobe"]: Refreshing state... [id=6309608:kayobe]
github_team_repository.developers_repositories["drac"]: Refreshing state... [id=6309608:drac]
github_team_repository.developers_repositories["ansible-role-luks"]: Refreshing state... [id=6309608:ansible-role-luks]
github_team_repository.developers_repositories["smslab-kayobe-config"]: Refreshing state... [id=6309608:smslab-kayobe-config]
github_team_repository.developers_repositories["ansible-role-os-config"]: Refreshing state... [id=6309608:ansible-role-os-config]
github_team_repository.developers_repositories["stackhpc-inspector-plugins"]: Refreshing state... [id=6309608:stackhpc-inspector-plugins]
github_team_repository.developers_repositories["ansible-collection-openstack-ops"]: Refreshing state... [id=6309608:ansible-collection-openstack-ops]
github_team_repository.developers_repositories["ansible-role-mlnx-ufm"]: Refreshing state... [id=6309608:ansible-role-mlnx-ufm]
github_team_repository.developers_repositories["stackhpc-kayobe-config"]: Refreshing state... [id=6309608:stackhpc-kayobe-config]
github_team_repository.developers_repositories["ironic-python-agent"]: Refreshing state... [id=6309608:ironic-python-agent]
github_team_repository.developers_repositories["ansible-collection-cephadm"]: Refreshing state... [id=6309608:ansible-collection-cephadm]
github_team_repository.developers_repositories["ansible-role-os-container-clusters"]: Refreshing state... [id=6309608:ansible-role-os-container-clusters]
github_team_repository.developers_repositories["networking-generic-switch"]: Refreshing state... [id=6309608:networking-generic-switch]
github_team_repository.developers_repositories["ansible-role-os-images"]: Refreshing state... [id=6309608:ansible-role-os-images]
github_team_repository.developers_repositories["drac-facts"]: Refreshing state... [id=6309608:drac-facts]
github_team_repository.developers_repositories["ansible-role-os-flavors"]: Refreshing state... [id=6309608:ansible-role-os-flavors]
github_team_repository.developers_repositories["ansible-collection-pulp"]: Refreshing state... [id=6309608:ansible-collection-pulp]
github_team_repository.developers_repositories["ansible-role-libvirt-host"]: Refreshing state... [id=6309608:ansible-role-libvirt-host]
github_team_repository.developers_repositories["ansible-role-gluster-cluster"]: Refreshing state... [id=6309608:ansible-role-gluster-cluster]
github_team_repository.developers_repositories["monasca-default-alarms"]: Refreshing state... [id=6309608:monasca-default-alarms]
github_team_repository.developers_repositories["barbican"]: Refreshing state... [id=6309608:barbican]
github_team_repository.ansible_repositories["ansible-role-os-volumes"]: Refreshing state... [id=2454000:ansible-role-os-volumes]
github_team_repository.ansible_repositories["ansible-role-os-host-aggregates"]: Refreshing state... [id=2454000:ansible-role-os-host-aggregates]
github_team_repository.ansible_repositories["ansible-role-libvirt-host"]: Refreshing state... [id=2454000:ansible-role-libvirt-host]
github_team_repository.ansible_repositories["ansible-timezone"]: Refreshing state... [id=2454000:ansible-timezone]
github_team_repository.ansible_repositories["ansible-role-os-networks"]: Refreshing state... [id=2454000:ansible-role-os-networks]
github_team_repository.ansible_repositories["monasca-default-alarms"]: Refreshing state... [id=2454000:monasca-default-alarms]
github_team_repository.ansible_repositories["ansible-role-os-ironic-state"]: Refreshing state... [id=2454000:ansible-role-os-ironic-state]
github_team_repository.ansible_repositories["ansible-role-os-flavors"]: Refreshing state... [id=2454000:ansible-role-os-flavors]
github_team_repository.ansible_repositories["ansible-role-libvirt-vm"]: Refreshing state... [id=2454000:ansible-role-libvirt-vm]
github_team_repository.ansible_repositories["ansible-role-gluster-cluster"]: Refreshing state... [id=2454000:ansible-role-gluster-cluster]
github_team_repository.ansible_repositories["ansible-role-mlnx-neo"]: Refreshing state... [id=2454000:ansible-role-mlnx-neo]
github_team_repository.ansible_repositories["ansible-role-systemd-networkd"]: Refreshing state... [id=2454000:ansible-role-systemd-networkd]
github_team_repository.ansible_repositories["openstack-config"]: Refreshing state... [id=2454000:openstack-config]
github_team_repository.ansible_repositories["ansible-role-grubcmdline"]: Refreshing state... [id=2454000:ansible-role-grubcmdline]
github_team_repository.ansible_repositories["ansible-role-cluster-infra"]: Refreshing state... [id=2454000:ansible-role-cluster-infra]
github_team_repository.ansible_repositories["ansible-role-os-projects"]: Refreshing state... [id=2454000:ansible-role-os-projects]
github_team_repository.ansible_repositories["ansible-role-grafana-conf"]: Refreshing state... [id=2454000:ansible-role-grafana-conf]
github_team_repository.ansible_repositories["ansible-role-mlnx-ufm"]: Refreshing state... [id=2454000:ansible-role-mlnx-ufm]
github_team_repository.ansible_repositories["ansible-role-openvpn"]: Refreshing state... [id=2454000:ansible-role-openvpn]
github_team_repository.ansible_repositories["ansible-collection-cephadm"]: Refreshing state... [id=2454000:ansible-collection-cephadm]
github_team_repository.ansible_repositories["ansible-collection-hashicorp"]: Refreshing state... [id=2454000:ansible-collection-hashicorp]
github_team_repository.ansible_repositories["ansible-role-luks"]: Refreshing state... [id=2454000:ansible-role-luks]
github_team_repository.ansible_repositories["ansible-role-os-shade"]: Refreshing state... [id=2454000:ansible-role-os-shade]
github_team_repository.ansible_repositories["ansible-collection-pulp"]: Refreshing state... [id=2454000:ansible-collection-pulp]
github_team_repository.ansible_repositories["ansible-role-os-container-clusters"]: Refreshing state... [id=2454000:ansible-role-os-container-clusters]
github_team_repository.ansible_repositories["ansible-role-monasca-rsyslog"]: Refreshing state... [id=2454000:ansible-role-monasca-rsyslog]
github_team_repository.ansible_repositories["ansible-role-rundeck"]: Refreshing state... [id=2454000:ansible-role-rundeck]
github_team_repository.ansible_repositories["drac"]: Refreshing state... [id=2454000:drac]
github_team_repository.ansible_repositories["ansible-role-os-openstackclient"]: Refreshing state... [id=2454000:ansible-role-os-openstackclient]
github_team_repository.ansible_repositories["ansible-role-vxlan"]: Refreshing state... [id=2454000:ansible-role-vxlan]
github_team_repository.ansible_repositories["drac-facts"]: Refreshing state... [id=2454000:drac-facts]
github_team_repository.ansible_repositories["ansible-role-mellanox-switch"]: Refreshing state... [id=2454000:ansible-role-mellanox-switch]
github_team_repository.ansible_repositories["stackhpc.ssm"]: Refreshing state... [id=2454000:stackhpc.ssm]
github_team_repository.ansible_repositories["ansible-collection-openstack-ops"]: Refreshing state... [id=2454000:ansible-collection-openstack-ops]
github_team_repository.ansible_repositories["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=2454000:ansible-role-dell-powerconnect-switch]
github_team_repository.ansible_repositories["ansible-role-os-openstacksdk"]: Refreshing state... [id=2454000:ansible-role-os-openstacksdk]
github_team_repository.ansible_repositories["stackhpc.ipmi-exporter"]: Refreshing state... [id=2454000:stackhpc.ipmi-exporter]
github_team_repository.ansible_repositories["ansible-role-os-images"]: Refreshing state... [id=2454000:ansible-role-os-images]
github_team_repository.ansible_repositories["ansible-role-os-config"]: Refreshing state... [id=2454000:ansible-role-os-config]
github_team_repository.ansible_repositories["ansible-role-sriov"]: Refreshing state... [id=2454000:ansible-role-sriov]
github_team_membership.team_membership["Kayobe:priteau"]: Refreshing state... [id=6156230:priteau]
github_team_membership.team_membership["Kayobe:jovial"]: Refreshing state... [id=6156230:jovial]
github_team_membership.team_membership["Developers:stackhpc-ci"]: Refreshing state... [id=6309608:stackhpc-ci]
github_team_membership.team_membership["OpenStack:dougszumski"]: Refreshing state... [id=6372899:dougszumski]
github_team_membership.team_membership["Ansible:cityofships"]: Refreshing state... [id=2454000:cityofships]
github_team_membership.team_membership["Developers:technowhizz"]: Refreshing state... [id=6309608:technowhizz]
github_team_membership.team_membership["Ansible:oneswig"]: Refreshing state... [id=2454000:oneswig]
github_team_membership.team_membership["OpenStack:markgoddard"]: Refreshing state... [id=6372899:markgoddard]
github_team_membership.team_membership["Developers:cityofships"]: Refreshing state... [id=6309608:cityofships]
github_team_membership.team_membership["SMSLab:GregWhiteyBialas"]: Refreshing state... [id=6372896:GregWhiteyBialas]
github_team_membership.team_membership["Ansible:sjpb"]: Refreshing state... [id=2454000:sjpb]
github_team_membership.team_membership["OpenStack:priteau"]: Refreshing state... [id=6372899:priteau]
github_team_membership.team_membership["Developers:sjpb"]: Refreshing state... [id=6309608:sjpb]
github_team_membership.team_membership["Developers:darmach"]: Refreshing state... [id=6309608:darmach]
github_team_membership.team_membership["Developers:sd109"]: Refreshing state... [id=6309608:sd109]
github_team_membership.team_membership["Developers:g0rgamesh"]: Refreshing state... [id=6309608:g0rgamesh]
github_team_membership.team_membership["SMSLab:grzegorzkoper"]: Refreshing state... [id=6372896:grzegorzkoper]
github_team_membership.team_membership["Developers:dougszumski"]: Refreshing state... [id=6309608:dougszumski]
github_team_membership.team_membership["Developers:m-bull"]: Refreshing state... [id=6309608:m-bull]
github_team_membership.team_membership["Developers:johntaylorsc"]: Refreshing state... [id=6309608:johntaylorsc]
github_team_membership.team_membership["Developers:jcoquillon"]: Refreshing state... [id=6309608:jcoquillon]
github_team_membership.team_membership["Kayobe:bbezak"]: Refreshing state... [id=6156230:bbezak]
github_team_membership.team_membership["Batch:jovial"]: Refreshing state... [id=6372897:jovial]
github_team_membership.team_membership["Ansible:g0rgamesh"]: Refreshing state... [id=2454000:g0rgamesh]
github_team_membership.team_membership["Developers:k-s-dean"]: Refreshing state... [id=6309608:k-s-dean]
github_team_membership.team_membership["Batch:sjpb"]: Refreshing state... [id=6372897:sjpb]
github_team_membership.team_membership["Kayobe:dougszumski"]: Refreshing state... [id=6156230:dougszumski]
github_team_membership.team_membership["Developers:jovial"]: Refreshing state... [id=6309608:jovial]
github_team_membership.team_membership["Developers:oneswig"]: Refreshing state... [id=6309608:oneswig]
github_team_membership.team_membership["Ansible:grzegorzkoper"]: Refreshing state... [id=2454000:grzegorzkoper]
github_team_membership.team_membership["ReleaseTrain:m-bull"]: Refreshing state... [id=6372895:m-bull]
github_team_membership.team_membership["ReleaseTrain:jackhodgkiss"]: Refreshing state... [id=6372895:jackhodgkiss]
github_team_membership.team_membership["Developers:mkjpryor"]: Refreshing state... [id=6309608:mkjpryor]
github_team_membership.team_membership["OpenStack:jovial"]: Refreshing state... [id=6372899:jovial]
github_team_membership.team_membership["Ansible:m-bull"]: Refreshing state... [id=2454000:m-bull]
github_team_membership.team_membership["Ansible:JohnGarbutt"]: Refreshing state... [id=2454000:JohnGarbutt]
github_team_membership.team_membership["Batch:m-bull"]: Refreshing state... [id=6372897:m-bull]
github_team_membership.team_membership["OpenStack:mnasiadka"]: Refreshing state... [id=6372899:mnasiadka]
github_team_membership.team_membership["ReleaseTrain:cityofships"]: Refreshing state... [id=6372895:cityofships]
github_team_membership.team_membership["Developers:grzegorzkoper"]: Refreshing state... [id=6309608:grzegorzkoper]
github_team_membership.team_membership["SMSLab:g0rgamesh"]: Refreshing state... [id=6372896:g0rgamesh]
github_team_membership.team_membership["Ansible:mnasiadka"]: Refreshing state... [id=2454000:mnasiadka]
github_team_membership.team_membership["ReleaseTrain:stackhpc-ci"]: Refreshing state... [id=6372895:stackhpc-ci]
github_team_membership.team_membership["Ansible:GregWhiteyBialas"]: Refreshing state... [id=2454000:GregWhiteyBialas]
github_team_membership.team_membership["Ansible:markgoddard"]: Refreshing state... [id=2454000:markgoddard]
github_team_membership.team_membership["SMSLab:jovial"]: Refreshing state... [id=6372896:jovial]
github_team_repository.openstack_repositories["cloudkitty-dashboard"]: Refreshing state... [id=6372899:cloudkitty-dashboard]
github_team_membership.team_membership["Developers:JohnGarbutt"]: Refreshing state... [id=6309608:JohnGarbutt]
github_team_membership.team_membership["SMSLab:k-s-dean"]: Refreshing state... [id=6372896:k-s-dean]
github_team_membership.team_membership["OpenStack:JohnGarbutt"]: Refreshing state... [id=6372899:JohnGarbutt]
github_team_membership.team_membership["Developers:motehue"]: Refreshing state... [id=6309608:motehue]
github_team_membership.team_membership["Kayobe:mnasiadka"]: Refreshing state... [id=6156230:mnasiadka]
github_team_membership.team_membership["Developers:markgoddard"]: Refreshing state... [id=6309608:markgoddard]
github_team_membership.team_membership["ReleaseTrain:priteau"]: Refreshing state... [id=6372895:priteau]
github_team_membership.team_membership["Kayobe:markgoddard"]: Refreshing state... [id=6156230:markgoddard]
github_team_membership.team_membership["Azimuth:stackhpc-ci"]: Refreshing state... [id=6372898:stackhpc-ci]
github_team_membership.team_membership["Ansible:jovial"]: Refreshing state... [id=2454000:jovial]
github_team_membership.team_membership["ReleaseTrain:mnasiadka"]: Refreshing state... [id=6372895:mnasiadka]
github_team_membership.team_membership["SMSLab:cityofships"]: Refreshing state... [id=6372896:cityofships]
github_team_membership.team_membership["Ansible:jackhodgkiss"]: Refreshing state... [id=2454000:jackhodgkiss]
github_team_membership.team_membership["Developers:Alex-Welsh"]: Refreshing state... [id=6309608:Alex-Welsh]
github_team_membership.team_membership["Developers:jackhodgkiss"]: Refreshing state... [id=6309608:jackhodgkiss]
github_team_membership.team_membership["SMSLab:bbezak"]: Refreshing state... [id=6372896:bbezak]
github_team_membership.team_membership["Ansible:priteau"]: Refreshing state... [id=2454000:priteau]
github_team_membership.team_membership["Developers:GregWhiteyBialas"]: Refreshing state... [id=6309608:GregWhiteyBialas]
github_team_membership.team_membership["SMSLab:dougszumski"]: Refreshing state... [id=6372896:dougszumski]
github_team_membership.team_membership["ReleaseTrain:markgoddard"]: Refreshing state... [id=6372895:markgoddard]
github_team_membership.team_membership["Ansible:dougszumski"]: Refreshing state... [id=2454000:dougszumski]
github_team_membership.team_membership["OpenStack:stackhpc-ci"]: Refreshing state... [id=6372899:stackhpc-ci]
github_team_membership.team_membership["Ansible:bbezak"]: Refreshing state... [id=2454000:bbezak]
github_team_membership.team_membership["Developers:priteau"]: Refreshing state... [id=6309608:priteau]
github_team_membership.team_membership["Developers:scrungus"]: Refreshing state... [id=6309608:scrungus]
github_team_membership.team_membership["Batch:stackhpc-ci"]: Refreshing state... [id=6372897:stackhpc-ci]
github_team_membership.team_membership["SMSLab:darmach"]: Refreshing state... [id=6372896:darmach]
github_team_membership.team_membership["SMSLab:mnasiadka"]: Refreshing state... [id=6372896:mnasiadka]
github_team_membership.team_membership["SMSLab:markgoddard"]: Refreshing state... [id=6372896:markgoddard]
github_team_membership.team_membership["Ansible:stackhpc-ci"]: Refreshing state... [id=2454000:stackhpc-ci]
github_team_membership.team_membership["Developers:bbezak"]: Refreshing state... [id=6309608:bbezak]
github_team_membership.team_membership["Developers:mnasiadka"]: Refreshing state... [id=6309608:mnasiadka]
github_team_membership.team_membership["Ansible:k-s-dean"]: Refreshing state... [id=2454000:k-s-dean]
github_team_repository.openstack_repositories["ironic-python-agent"]: Refreshing state... [id=6372899:ironic-python-agent]
github_team_repository.openstack_repositories["bifrost"]: Refreshing state... [id=6372899:bifrost]
github_team_repository.releasetrain_repositories["stackhpc-release-train"]: Refreshing state... [id=6372895:stackhpc-release-train]
github_team_repository.openstack_repositories["networking-generic-switch"]: Refreshing state... [id=6372899:networking-generic-switch]
github_team_repository.openstack_repositories["barbican"]: Refreshing state... [id=6372899:barbican]
github_team_repository.releasetrain_repositories["stackhpc-release-train-clients"]: Refreshing state... [id=6372895:stackhpc-release-train-clients]
github_team_repository.openstack_repositories["stackhpc-inspector-plugins"]: Refreshing state... [id=6372899:stackhpc-inspector-plugins]
github_team_repository.openstack_repositories["cloudkitty"]: Refreshing state... [id=6372899:cloudkitty]
github_team_repository.openstack_repositories["magnum"]: Refreshing state... [id=6372899:magnum]
github_branch_protection.openstack_branch_protection["barbican"]: Refreshing state... [id=BPR_kwDOFrpfjc4BpCeV]
github_branch_protection.openstack_branch_protection["stackhpc-inspector-plugins"]: Refreshing state... [id=BPR_kwDOBbVFQ84BpCf8]
github_branch_protection.openstack_branch_protection["bifrost"]: Refreshing state... [id=BPR_kwDOBP6UUc4BpCfL]
github_branch_protection.openstack_branch_protection["cloudkitty-dashboard"]: Refreshing state... [id=BPR_kwDOGKVges4BpCfP]
github_branch_protection.openstack_branch_protection["magnum"]: Refreshing state... [id=BPR_kwDOBV3xHM4BpCeX]
github_branch_protection.openstack_branch_protection["cloudkitty"]: Refreshing state... [id=BPR_kwDODjOPNs4BpCd6]
github_branch_protection.openstack_branch_protection["ironic-python-agent"]: Refreshing state... [id=BPR_kwDOBfZpf84BpCfR]
github_branch_protection.openstack_branch_protection["networking-generic-switch"]: Refreshing state... [id=BPR_kwDOBTx-Ns4BpCfl]
github_branch_protection.ansible_branch_protection["ansible-role-os-volumes"]: Refreshing state... [id=BPR_kwDOByURTc4BpCgi]
github_branch_protection.ansible_branch_protection["ansible-role-os-container-clusters"]: Refreshing state... [id=BPR_kwDOBatpoM4BpCgR]
github_branch_protection.ansible_branch_protection["drac"]: Refreshing state... [id=BPR_kwDOBJYwns4BpCfJ]
github_branch_protection.ansible_branch_protection["ansible-role-mellanox-switch"]: Refreshing state... [id=BPR_kwDOCEL8kc4BpCfV]
github_branch_protection.ansible_branch_protection["ansible-collection-cephadm"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjExMTg3MTk=]
github_branch_protection.ansible_branch_protection["ansible-role-mlnx-neo"]: Refreshing state... [id=BPR_kwDOB7QCS84BpCfc]
github_branch_protection.ansible_branch_protection["ansible-role-os-host-aggregates"]: Refreshing state... [id=BPR_kwDOEJNi5c4BpCgc]
github_branch_protection.ansible_branch_protection["ansible-role-cluster-infra"]: Refreshing state... [id=BPR_kwDOBdbZh84BpCfU]
github_branch_protection.ansible_branch_protection["ansible-role-os-ironic-state"]: Refreshing state... [id=BPR_kwDOBsuAMc4BpCfD]
github_branch_protection.ansible_branch_protection["stackhpc.ipmi-exporter"]: Refreshing state... [id=BPR_kwDODLAMI84BpCgm]
github_branch_protection.ansible_branch_protection["ansible-role-grubcmdline"]: Refreshing state... [id=BPR_kwDODiDfUM4BpCfj]
github_branch_protection.ansible_branch_protection["ansible-role-sriov"]: Refreshing state... [id=BPR_kwDODiNasc4BpCfZ]
github_branch_protection.ansible_branch_protection["ansible-role-os-projects"]: Refreshing state... [id=BPR_kwDOBTZwnM4BpCgN]
github_branch_protection.ansible_branch_protection["ansible-role-systemd-networkd"]: Refreshing state... [id=BPR_kwDOFIjuzM4BpCfQ]
github_branch_protection.ansible_branch_protection["ansible-role-vxlan"]: Refreshing state... [id=BPR_kwDOHyZdIM4BqbCG]
github_branch_protection.ansible_branch_protection["ansible-role-os-networks"]: Refreshing state... [id=BPR_kwDOBXPuos4BpCgY]
github_branch_protection.ansible_branch_protection["ansible-collection-openstack-ops"]: Refreshing state... [id=BPR_kwDOG4hMN84Bc_YV]
github_branch_protection.ansible_branch_protection["ansible-role-os-images"]: Refreshing state... [id=BPR_kwDOBXdAYs4BpCgB]
github_branch_protection.ansible_branch_protection["ansible-role-gluster-cluster"]: Refreshing state... [id=BPR_kwDOB9ntlc4BpCfp]
github_branch_protection.ansible_branch_protection["ansible-role-os-flavors"]: Refreshing state... [id=BPR_kwDOBXPtVM4BpCfA]
github_branch_protection.ansible_branch_protection["ansible-collection-pulp"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE0MzY1NDA=]
github_branch_protection.ansible_branch_protection["ansible-role-libvirt-vm"]: Refreshing state... [id=BPR_kwDOBr7-YM4BpCg0]
github_branch_protection.ansible_branch_protection["ansible-role-os-openstacksdk"]: Refreshing state... [id=BPR_kwDODk4IW84BpCgz]
github_branch_protection.ansible_branch_protection["ansible-role-os-shade"]: Refreshing state... [id=BPR_kwDOBTaakM4BpCfd]
github_branch_protection.batch_branch_protection["ansible-role-openhpc"]: Refreshing state... [id=BPR_kwDOCaouHM4BVEon]
github_branch_protection.ansible_branch_protection["ansible-role-dell-powerconnect-switch"]: Refreshing state... [id=BPR_kwDOCBuys84BpCfn]
github_branch_protection.ansible_branch_protection["ansible-role-monasca-rsyslog"]: Refreshing state... [id=BPR_kwDOBmpuEM4BpCg3]
github_branch_protection.ansible_branch_protection["stackhpc.ssm"]: Refreshing state... [id=BPR_kwDODJW8qs4BpCfr]
github_branch_protection.ansible_branch_protection["ansible-role-luks"]: Refreshing state... [id=BPR_kwDODyl8rs4BpCgH]
github_branch_protection.ansible_branch_protection["ansible-role-os-config"]: Refreshing state... [id=BPR_kwDOBqiDnc4BpCgx]
github_branch_protection.ansible_branch_protection["drac-facts"]: Refreshing state... [id=BPR_kwDOBKFy084BpCfk]
github_branch_protection.ansible_branch_protection["ansible-collection-hashicorp"]: Refreshing state... [id=BPR_kwDOFdyqDs4BY-tF]
github_branch_protection.ansible_branch_protection["ansible-role-openvpn"]: Refreshing state... [id=BPR_kwDOCnI62s4BpCf5]
github_branch_protection.ansible_branch_protection["ansible-role-rundeck"]: Refreshing state... [id=BPR_kwDODU4Yts4Bohci]
github_branch_protection.ansible_branch_protection["monasca-default-alarms"]: Refreshing state... [id=BPR_kwDOC7HhEM4BpCgW]
github_branch_protection.ansible_branch_protection["ansible-role-mlnx-ufm"]: Refreshing state... [id=BPR_kwDOB7QBv84BpCgo]
github_branch_protection.ansible_branch_protection["ansible-role-libvirt-host"]: Refreshing state... [id=BPR_kwDOBr78jM4BpCgt]
github_branch_protection.ansible_branch_protection["ansible-role-grafana-conf"]: Refreshing state... [id=BPR_kwDOBqfvY84BpCeh]
github_branch_protection.ansible_branch_protection["openstack-config"]: Refreshing state... [id=BPR_kwDOH-4mes4Bunv2]
github_branch_protection.ansible_branch_protection["ansible-timezone"]: Refreshing state... [id=BPR_kwDOCgK3sc4BpCd8]
github_branch_protection.ansible_branch_protection["ansible-role-os-openstackclient"]: Refreshing state... [id=BPR_kwDOBTabZM4BpCgV]
github_branch_protection.releasetrain_branch_protection["stackhpc-release-train"]: Refreshing state... [id=BPR_kwDOFsVVms4BY-mV]
github_branch_protection.releasetrain_branch_protection["stackhpc-release-train-clients"]: Refreshing state... [id=BPR_kwDOGdBJ884Babm4]
github_branch_protection.smslab_branch_protection["smslab-kayobe-config"]: Refreshing state... [id=BPR_kwDOElyYwM4BawKv]
github_branch_protection.smslab_branch_protection["terraform-bastion"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjA0ODY2MTk=]
github_branch_protection.smslab_branch_protection["smslab-config"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjEzMzI=]
github_branch_protection.kayobe_branch_protection["kayobe"]: Refreshing state... [id=BPR_kwDOHNO7LM4BpChh]
github_branch_protection.kayobe_branch_protection["kolla"]: Refreshing state... [id=BPR_kwDOBOP9Nc4BpCfE]
github_branch_protection.kayobe_branch_protection["kolla-ansible"]: Refreshing state... [id=BPR_kwDOBOeH8M4BpCd3]
github_branch_protection.kayobe_branch_protection["stackhpc-kayobe-config"]: Refreshing state... [id=BPR_kwDOGc9St84BqrpQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.kayobe_branch_protection["openstack-admin-guide"] will be created
  + resource "github_branch_protection" "kayobe_branch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "stackhpc/**"
      + push_restrictions               = [
          + "T_kwDOAVsmNM4AYEbo",
        ]
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkyOTQ0MzQ2MzQ="
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Build OpenStack admin guide",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.smslab_branch_protection["smslab-config"] will be updated in-place
  ~ resource "github_branch_protection" "smslab_branch_protection" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjEzMzI="
        # (10 unchanged attributes hidden)

      ~ required_status_checks {
          ~ contexts = [
              - "test",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.smslab_branch_protection["smslab-kayobe-config"] will be updated in-place
  ~ resource "github_branch_protection" "smslab_branch_protection" {
        id                              = "BPR_kwDOElyYwM4BawKv"
      ~ pattern                         = "smslab/wallaby" -> "smslab/yoga"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_branch_protection.smslab_branch_protection["terraform-bastion"] will be updated in-place
  ~ resource "github_branch_protection" "smslab_branch_protection" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjA0ODY2MTk="
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ require_code_owner_reviews      = false -> true
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          ~ contexts = [
              - "Terraform (sausage)",
              - "Terraform (vglab)",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # github_issue_label.community_files_label["openstack-admin-guide"] will be created
  + resource "github_issue_label" "community_files_label" {
      + color       = "3F84E5"
      + description = "Community files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "community-files"
      + repository  = "openstack-admin-guide"
      + url         = (known after apply)
    }

  # github_issue_label.stackhpc_ci_label["openstack-admin-guide"] will be created
  + resource "github_issue_label" "stackhpc_ci_label" {
      + color       = "E6E2C0"
      + description = "Automated action performed by stackhpc-ci"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "stackhpc-ci"
      + repository  = "openstack-admin-guide"
      + url         = (known after apply)
    }

  # github_issue_label.workflows_label["openstack-admin-guide"] will be created
  + resource "github_issue_label" "workflows_label" {
      + color       = "638475"
      + description = "Workflow files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "workflows"
      + repository  = "openstack-admin-guide"
      + url         = (known after apply)
    }

  # github_repository.repositories["openstack-admin-guide"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "openstack-admin-guide"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["stackhpc-kayobe-config"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "stackhpc-kayobe-config"
        name                   = "stackhpc-kayobe-config"
        # (24 unchanged attributes hidden)
    }

  # github_team_repository.developers_repositories["openstack-admin-guide"] will be created
  + resource "github_team_repository" "developers_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "openstack-admin-guide"
      + team_id    = "6309608"
    }

  # github_team_repository.kayobe_repositories["openstack-admin-guide"] will be created
  + resource "github_team_repository" "kayobe_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "openstack-admin-guide"
      + team_id    = "6156230"
    }

Plan: 7 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @markgoddard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub`*